app/controllers/saved_articles_controller.rb

  def index
    @saved_articles = SavedArticle.all
---
SELECT "saved_articles".* FROM "saved_articles"

    def set_saved_article
      @saved_article = SavedArticle.find(params[:id])
---
SELECT  "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]